Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["areweinterplanetaryyet.org"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "areweinterplanetaryyet.org"
        name                        = "areweinterplanetaryyet.org"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository.this["sharness"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "sharness"
        name                        = "sharness"
        # (34 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository_collaborator.this["go-ds-pebble:go core team"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "go-ds-pebble"
      + username                    = "Go Core Team"
    }

  # github_repository_file.this["areweinterplanetaryyet.org/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "areweinterplanetaryyet.org"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["dapps-wg/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "dapps-wg"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-ipfs-bitswap/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-ipfs-bitswap"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["sharness/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "sharness"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["working-groups/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "working-groups"
      + sha                 = (known after apply)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->